---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesEdgeMatchForWidthSome
source: html/141c7ffb-ff67-3dca-93e6-e8a24df16751.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesEdgeMatchForWidthSome Property

Division family cannot be used with the selected edge condition for some widths of hosts

## Syntax (C#)
```csharp
public static FailureDefinitionId DivideVolumesProfilesEdgeMatchForWidthSome { get; }
```